ymaps.ready(init);

var myMap;

var gold = [];
var placemarks = [gold];

function init() {
    myMap = new ymaps.Map("map", {
        center: [41.20, 74.00],
        zoom: 6,
        type: 'yandex#hybrid'
    });
    myMap.behaviors.enable('scrollZoom');
    myMap.controls.add('zoomControl', {
        float: 'none',
        position: {
            right: 40,
            top: 5
        }
    });

    var data = loadGeoData();
    for (var i=0; i < data.length; i++) {
        var row_data = data[i];

        var type = row_data[0];        
		var x = Number(row_data[10]);
		var y = Number(row_data[9]);
		var text = row_data[0];
        var size = Number(row_data[7]) * 10;
        
        var placemark = new ymaps.Placemark([x, y], {
			content: text,
			balloonContent: text + " тут!"
		},{
			iconContent: 'goold',
			preset: 'twirl#cinemaIcon',
			iconImageSize: [size, size],
            		iconImageOffset: [-size/2, -size/2],
		visible: false,
		});
		
		
	if (type == 'Золото') {
            gold.push(placemark);
        } 
    }
        putPlacemarksOnMap();
    var gold_button = new ymaps.control.Button('Золото');
    


    var typeControls = new ymaps.control.Group({
            items: [gold_button]
        }, {
            position: { left: 40 }
    });

    gold_button.events.add(['select'], function (e) {
        showGroup(gold);
    });
    gold_button.events.add(['deselect'], function (e) {
        hideGroup(gold);
    });
   

    myMap.controls.add(typeControls);
}


function showGroup(group) {
    myMap.setCenter([41.20, 74.00], 6, { duration: 1000 });
    for (var i = 0; i < group.length; i++) {
        group[i].options.set({ visible: true });
    }
}

function hideGroup(group) {
    for (var i = 0; i < group.length; i++) {
        group[i].options.set({ visible: false });
    }
}


function putPlacemarksOnMap() {
    for (var i = 0; i < placemarks.length; i++) {
        for (var j = 0; j < placemarks[i].length; j++) {
            myMap.geoObjects.add(placemarks[i][j]);
        }        
    }
};



function loadGeoData() {
var data = [
["Золото","Благородные металлы","Металлы","Рудные","Проявление","","Мелкое","3","","71.85","42.7","13241885","4734291","","71.85","42.7","71.85","42.7","Манасский район","/icon/Au04.png","753__Kichikkaiyndy.txt","","","","Таласская область","","42.7","Поисково-оценочные работы (канавы, скважины) в 1980-83гг, выс. 1200-1520м, перспективно. <br><br>Р1 на глуб. 10-150м всего 2.368т, в т.ч. по 34 мелким линзов. телам 0.568т (11.9г/т). <br><br>Au-5.6 г/т <br>Cu-0.3-1.0 % <br>WO3-0.12-0.19 % <br>Bi-до 0.5%  <br>Pt-0.01-3.0% <br><br>В вулканогенно-осадочных породах Є-О1, прорванных интрузией гранитоидов  - 53 линзовидные рудные тела (9-280мх0.2-40м)."],
["Золото","Благородные металлы","Металлы","Рудные","Проявление","","","0","","71.87","42.68","13243182","4732388","","71.87","42.68","71.87","42.68","Манасский район","/icon/Au04.png","754__Katranka.txt","","","","Таласская область","","42.68","1980-83гг -  геолсъемка м-ба 1:50000 с поисковой детализацией(канавы, скважины),  выс. 1100-1250м, перспективное. <br><br>Р1 на глуб. 20м 0.026т. <br><br>Au-14.43г/т<br><br>В вулканогенно-осадочных породах Є-О1 - 5 рудных  линзовидных тел (1.0-5.7мх0.2-5.3м)."],
["Золото","Благородные металлы","Металлы","Рудные","Проявление","","","0","","72.58","42.67","13301872","4728607","4","72.58","42.67","72.58","42.67","Таласский район","/icon/Au04.png","755__Barkol (#9).txt","","","","Таласская область","","42.67","1973г -  поисково-ревизионные работы (канавы, шурфы), выс. 2400-2600м, доступно, перспективы ограничены. <br><br>Р1 на глуб. 25м 0.006т. <br><br>Au-10г/т <br>Ag-10г/т <br><br>Блок осадочно-метаморфических пород O1-2 в зоне смятия,  рудная жила - 50мх0.2м."],
["Золото","Благородные металлы","Металлы","Рудные","Проявление","","","0","","73.48","42.72","13375759","4732444","","73.48","42.72","73.48","42.72","Панфиловский район","/icon/Au04.png","756__Granotogorskoe East.txt","","","","Чуйская область","","42.72","1950г -  поиски м-ба 1:25000 (канавы, шурфы, скважины), условия благоприятные, выс. 1200-2000 м, перспективное. )  <br><br>Р2 на глуб. 100м Au -0.403т. <br><br>Au-6г/т <br>Pb -0.62-35.7% <br>Zn-0.07-0.22% <br>Cu -0.47-3.4% <br><br>Среди песчано-сланцевых отложений D3-C1 три жильных рудных тела (100-150х0.2-1.6м)."],
["Золото","Благородные металлы","Металлы","Рудные","Проявление","","","0","","75.68","42.73","13555961","4733406","4","75.68","42.73","75.68","42.73","Кеминский район","/icon/Au04.png","757__Severny prpsp..txt","","","","Чуйская область","","42.73","1993г -  поиски м-ба 1:50000, выс. 1540м,  перспективное. <br><br>Р2 на глуб. 50м 0.45т. <br><br>Au-6.0г/т <br>Cu -до 1.0% <br><br>В гнейсовидных гранодиоритах O1-2 минерализованная зона (100х5-7м)."],
["Золото","Благородные металлы","Металлы","Рудные","Коренное месторождение","","","0","","75.62","42.67","13550556","4725958","4","75.62","42.67","75.62","42.67","Кеминский район","/icon/Au04.png","758__Kyzyl-Bulakskoe.txt","","","","Чуйская область","","42.67","Поиски при геолсъемке м-ба 1:50000  (канавы, скважины), выс. 1950м, легкая доступность,  район освоен. Р2 на глуб. 50м 0.271т. <br><br>Au-2.7г/т <br>Pb -1.18%<br><br>В гнейсовидных гранитах O1-2 - 2 жильных рудных тела (40-70х0.7-1.4м)."],
["Золото","Благородные металлы","Металлы","Рудные","Проявление","","","0","","76.23","42.9","13600732","4752433","4","76.23","42.9","76.23","42.9","Кеминский район","/icon/Au04.png","759__Vysotnoe.txt","","","","Чуйская область","","42.9","1993г - поиски м-ба 1:50000, выс. 3550м, доступно, район освоен  <br>Перспективное. <br>На глуб. 100м Р2 -1.87т.<br><br>Au-3.0г/т <br><br>На контакте сланцев (PR1) c плагиогранитами O1 - 2 минерализованных зоны (200мх10-15м)."],
["Золото","Благородные металлы","Металлы","Рудные","Коренное месторождение","114","Мелкое","3","","76.2","42.88","13598036","4750541","","76.2","42.88","76.2","42.88","Кеминский район","/icon/Au04.png","760__Komator.txt","","","","Чуйская область","","42.88","1995г - поисково-оценочные работы (канавы, скважины),  выс. 2900-3500м, легкая доступность, район освоен,  по ТЭС разработка рентабельна. <br><br>На  глуб. 90м <br>С2 -2.74т. <br>Р1- 3.83т<br>С2+Р1 - 6.57т (7.55г/т) <br><br>Au-7.55г/т <br>Pb-0.4 % <br>Zn-до 1.0 % <br>Cu -0.07 % <br>As-до 1.0% <br><br>Кварцевая жила в амфиболовых сланцах протерозоя (600мх3.9м)."],
["Золото","Благородные металлы","Металлы","Рудные","Коренное месторождение","","","0","","76.22","42.85","13599452","4746858","","76.22","42.85","76.22","42.85","Кеминский район","/icon/Au04.png","761__Karaultas.txt","","","","Чуйская область","","42.85","1993г  -  поиски м-ба 1:50000, выс. 3400м, район освоен. <br><br>Р2- 3.6т <br><br>Au-1.265г/т <br><br>В амфиболовых сланцах PR- жильная зона (250-800мх2.5-15.0м)."],
["Золото","Благородные металлы","Металлы","Рудные","Проявление","","","0","","76.67","42.88","13636162","4751191","","76.67","42.88","76.67","42.88","Кеминский район","/icon/Au04.png","762__Rassvet (Rassvet Mambetbulak).txt","","","","Чуйская область","","42.88","1954-56гг поисково-оценочные работы (канавы, пробы), выс. 3000-3200м, доступно, перспективное. <br><br>Р2- 0.7т <br><br>Au-8.02г/т <br><br>Среди амфиболовых сланцев O - серия кварцевых жил в зоне длиной 300м и мощностью 1.3м, рудное жильное тело 1.44х0.4х100м."],
["Золото","Благородные металлы","Металлы","Рудные","Проявление","","Мелкое","3","","76.73","42.87","13641647","4749450","","76.73","42.87","76.73","42.87","Кеминский район","/icon/Au04.png","763__Mambet-Bulak.txt","","","","Чуйская область","","42.87","1997 г -  поиски при ГДП м-ба 1:50000  (канавы, пробы  литохимия)  <br>выс. 3050м, доступно, район освоен. <br><br>На  глуб 100м Р1- 4.067т <br><br>Au-3.2г/т <br><br>В зоне надвига вулканитов I на мраморы О - серия минерализованных зон (80-400х0.9-13.0м) и рудных жил (100х3м)."],
["Золото","Благородные металлы","Металлы","Рудные","Проявление","","","0","","76.9","42.92","13655142","4755298","","76.9","42.92","76.9","42.92","Кеминский район","/icon/Au04.png","764__Almaty.txt","","","","Чуйская область","","42.92","1955г  -  поиски  <br>1997г - геолсъемка и поиски м-ба 1:50000  <br>выс. 3400м, район освоен. <br><br>На  глуб 50м Р2- 0.467т<br><br>Au-8.5г/т <br>Cu -до 0.7 % <br>Pb -0.45 % <br>Bi -0.5% <br>As- 1.0% <br>Ag-от 40 до 1200г/т З<br><br>Зона надвига сланцев О1-2 на терригенные толщи О1-2.  4 минерализованные зоны березитизации размера от 0.1х15  до  9.0х80м."],
["Золото","Благородные металлы","Металлы","Рудные","Коренное месторождение","115","Мелкое","3","","76.07","42.8","13587261","4741137","","76.07","42.8","76.07","42.8","Кеминский район","/icon/Au04.png","765__Dolpran.txt","","","","Чуйская область","","42.8","1949г  -  поиски (канавы, шурфы, штольни)  <br>1950-55гг  -  поисково-оценочные работы (канавы, шурфы, штольни, скважины),  запасы утверждены в 1955г<br>Условия благоприятные, выс. 1800-2100м, дорога,  ЛЭП в 5 км. <br><br>На  глуб.240м балансовые запасы <br>С1-1.477т <br>С2- 0.239т<br>С1+С2 - 1.716т <br><br>Au-5.9г/т <br>Cu -до 0.72% <br><br>В метаморфических сланцах PR и гранодиоритах О -15 рудных жил (18-500мх1.5-6.2м)."],
["Золото","Благородные металлы","Металлы","Рудные","Коренное месторождение","","","0","","76.22","42.82","13599505","4743155","","76.22","42.82","76.22","42.82","Кеминский район","/icon/Au04.png","766__Kokbulak Severny.txt","","","","Чуйская область","","42.82","1993г  -  поиски м-ба 1:50000 (канавы, пробы)  <br>выс. 3400м, легко доступно, район освоен. <br><br>Р1 на глуб. 50м 85.2кг. <br><br>Au-2.5г/т <br><br>В гнейсах и мигматитах PR - минерализованная зона (100мх2.0м)."],
["Золото","Благородные металлы","Металлы","Рудные","Коренное месторождение","","Мелкое","3","","76.02","42.72","13583282","4731830","","76.02","42.72","76.02","42.72","Кеминский район","/icon/Au04.png","767__Kyzyl-Bairak.txt","","","","Чуйская область","","42.72","1993г  -  поисково-оценочные работы (канавы, пробы)  <br>выс. 1650м, доступно, район освоен  <br>Перспективное. <br><br>На глуб. 60м <br>Р1-0.610т  <br>Р2-1.385т  <br>Р1+Р2 - 1.995т <br><br>Au-6.4г/т <br>Cu -0.36 % <br>Zn -0.01 % <br>Sb-0.05% <br><br>В пегматоидных гранитах минерализованная зона кварц-турмалиновых метасоматитов (130мх12.0м)"],
["Золото","Благородные металлы","Металлы","Рудные","Коренное месторождение","","","0","","77.07","42.93","13668706","4757470","","77.07","42.93","77.07","42.93","Кеминский район","/icon/Au04.png","768__Kashkasu.txt","","","","Чуйская область","","42.93","1970г  -  геолсъемка и поиски м-ба 1:50000 (штуфные пробы)  <br>выс. 4200м, трудная доступность, район не освоен, не изучено. <br><br>На  глуб. 50м Р2-0.206 т<br><br>Au-5.5 г/т <br><br>В песчаниках и алевролитах О2 - жильная зона (100х3м) и рудная жила (15х3.8м)"],
["Золото","Благородные металлы","Металлы","Рудные","Проявление","","","0","","77.13","42.9","13674242","4753903","","77.13","42.9","77.13","42.9","Кеминский район","/icon/Au04.png","769__Priozernoe.txt","","","","Чуйская область","","42.9","1997г  -  поиски м-ба 1:50000 (штуфные пробы)  <br>выс. 3200м, трудная доступнотсть, не изучено. <br><br>На  глуб. 50м Р2 - 1.0т <br><br>Au-5.0 г/т <br><br>В песчаниках олистостромового комплекса О1-2   -  минерализованная зона (60-90х800м)."],
["Золото","Благородные металлы","Металлы","Рудные","Проявление","","Мелкое","3","","77.48","42.87","13702939","4750985","","77.48","42.87","77.48","42.87","Иссык-Кульский район","/icon/Au04.png","770__Kokdjar.txt","","","","Иссык-Кульская область","","42.87","Известно с 1941г как полиметаллическое рудопоявление  <br>1973-74гг -  поиски при геолсъемке м-ба 1:50000 (канавы). <br>Условия благоприятные, выс. 2400м, перспективно. <br><br>На  глуб. 50-100м <br>Р1-0.18т <br>Р2 - 6.0т <br>Р1+Р2 - 6.18т <br><br>Au-5.8г/т <br>Pb - до 1.6 % <br>Сu - 1.0 % <br>As - 0.8 % <br>Mo - 0.01% <br>Ag- 22.8- 290.0 г/т <br><br>В серии надвигов среди известковых и терригенно-вулкпнических пород Є-О1 -  минерализованная зона (800х4.3м) и рудное тело (100х1.2м)."],
["Золото","Благородные металлы","Металлы","Рудные","Коренное месторождение","","","0","","77.53","42.87","13707025","4751107","","77.53","42.87","77.53","42.87","Иссык-Кульский район","/icon/Au04.png","771__Kokbulak prosp..txt","","","","Иссык-Кульская область","","42.87","1971г  -  геолсъемка м-ба 1:50000  <br>1971-77гг - поисково-оценочные работы (канавы) <br>выс. 2500-3200м, доступно. <br><br>Р2 на глуб. 100м <br>по жилам - 1.045т  <br>по зоне - 0.054т<br>всего -1.099 т <br><br>Au-9.2г/т <br>Ag- 0.8-25.6г/т <br>Pb -0.07 %<br>As - 0.6% <br><br>В зоне дробления по контакту мраморов и вулкано-терригенных отложений PZ1 (400х20м) - минерализованная жильная зона - 100х0.35м и 7 рудных жил - 15х2.0м."],
["Золото","Благородные металлы","Металлы","Рудные","Коренное месторождение","","","0","","77.58","42.87","13711111","4751231","","77.58","42.87","77.58","42.87","Иссык-Кульский район","/icon/Au04.png","772__Sutbulak East.txt","","","","Иссык-Кульская область","","42.87","1971г -  поисково-оценочные работы м-ба 1:10000 (канавы, бороздовые пробы, литохимия)  <br>выс. 3450м, доступно. <br>Перспективное. <br><br>Р2 на глуб. 200м <br>1.7т Au-6.42г/т <br>Ag- 10-1240г/т <br>Pb -0.03-15.4  <br>Co -до 1.6  <br>Zn -0.6-1.2  <br>Sb -0.5% <br><br>В вулканогенно-терригенных отложениях О2 и гранитах - 3 минерализованные жильные зоны (40-200х0.5-12м)."],
["Золото","Благородные металлы","Металлы","Рудные","Проявление","","","0","","77.58","42.85","13711168","4749379","","77.58","42.85","77.58","42.85","Иссык-Кульский район","/icon/Au04.png","773__Conglomeratovoe.txt","12","","","Иссык-Кульская область","","42.85","1971г -  поисково-оценочные работы м-ба 1:10000 (канавы, бороздовые пробы,  291  литохимия)  <br>Выс. 3200м, доступно,  перспективно. <br><br>Р2 на глуб. 150м 1.77т <br>Ag - 163.4т?? (163.4г/т) <br><br>Au-6.42г/т<br>Ag- 163.4г/т <br>Pb - до 8.4  <br>Zn -0.86  <br>Сu -0.5%<br><br>В вулканогенно-терригенных отложениях Є-О2 - минерализован.ные зоны суммарной длины 350м,  средней мощности 2.1м,  с глубиной  оруденения150м."],
["Золото","Благородные металлы","Металлы","Рудные","Коренное месторождение","","","0","","71.28","42.4","13193982","4702848","","71.28","42.4","71.28","42.4","Кара-Бууринский район","/icon/Au04.png","774__Sedlovinnoe.txt","","","","Таласская область","","42.4","Детальные поиски 1980-82гг (канавы, пробы)  <br>выс. 2200-2500м, доступно, район освоен.  <br><br>Р2 на глуб. 100м 0.35т  <br><br>Au-7.0г/т  <br><br>Ag- 2.9г/т  <br><br>Pb - 0.35%  <br><br>В экзоконтакте плагиогранитов V (угол ) -  минерализованная зона длиной 200м с золоторудными телами мощности 1.0м."],
["Золото","Благородные металлы","Металлы","Рудные","Коренное месторождение","","","0","","71.77","42.42","13233853","4703071","","71.81","42.42","71.81","42.42","Бакай-Атинский район","/icon/Au04.png","775__Bastyrma.txt","","","","Таласская область","","42.42","Геолсъемка м-ба 1:50000 <br>условия благоприятные, выс. 2450м, доступно, район освоен.  <br><br>Р2 на глуб. 100м 0.375т  <br><br>Au-5.0г/т  <br><br>В гранитах - минерализованная жильная зона - 100х3.0м."],
["Золото","Благородные металлы","Металлы","Рудные","Проявление","116","Мелкое","3","","71.77","42.38","13233712","4699367","","71.77","42.38","71.77","42.38","Бакай-Атинский район","/icon/Au04.png","776__Shyraldzhyn.txt","","","","Таласская область","","42.38","Поиски 1950, 1982-84гг, 1992г (канавы, бороздовые пробы, литохимия).  <br>Условия благоприятные, выс. 1900-2900м, доступно <br>Перспективное. <br><br>С2 -5.089т <br>Р1 - 9.875т <br>С2+Р1  <br>на глуб. 240м 14.967т  <br><br>Au-4.68г/т  <br><br>7 жил в гранитах длиной до 596м, мощностью 0.55-1.8м."],
["Золото","Благородные металлы","Металлы","Рудные","Коренное месторождение","","","0","","71.77","42.35","13233571","4695664","","71.77","42.35","71.77","42.35","Бакай-Атинский район","/icon/Au04.png","777__Saibulun.txt","","","","Таласская область","","42.35","Геолсъемка м-ба 1:50000.  <br>Условия благоприятные, выс. 2100м, доступно, перспективное.  <br><br>Р2 - 0.281т  <br><br>Au-15г/т  <br>Cu - 0.5%  <br><br>В зоне разлома, секущего алевролиты PZ1 - жила мощностью 1.5м, длиной 100м."],
["Золото","Благородные металлы","Металлы","Рудные","Коренное месторождение","117","Мелкое","3","","71.33","42.3","13197620","4691559","","71.38","42.3","71.38","42.3","Кара-Бууринский район","/icon/Au04.png","778__Taskain.txt","","","","Таласская область","","42.3","Геолсъемка м-ба 1:50000 <br>выс. 2500-3800м, ледники, район не освоен <br>Перспективное. <br><br><br>На глуб 100м:  <br>Р1 - 3.32т (4.6г/т)  <br>Р2 - 63.05т (1.0 г/т)  <br>Р1+Р2-66.37т (1.1г/т)  <br><br>Au в минерализованной зоне-1.0г/т  <br>в рудном теле 4.6г/т  <br><br>Зона меланжа (5кмх0.6-7.0км) среди филлитов и песчаников R2, минерализованная зона окварцевания (4200х50м)  внутри - рудное тело длиной 300м  мощн. 8.0м."],
["Золото","Благородные металлы","Металлы","Рудные","Проявление","","Мелкое","3","","71.4","42.23","13202805","4683917","","71.4","42.23","71.4","42.23","Кара-Бууринский район","/icon/Au04.png","779__Korumtor.txt","","","","Таласская область","","42.23","Геолсъемка м-ба 1:50000.  <br>Выс. 3026м, район не освоен и труднодоступен <br>Перспективное. <br><br>На глуб 100м:  <br>Р1 - 0.35т (10.0г/т)  <br>Р2 - 7.2т (2.0 г/т)  <br>Р1+Р2-7.55т (2.4г/т)  <br><br>Au в минерализ. зоне-2.0г/т, в рудном теле 10г/т  <br><br>Останец терригенно-карбонатных пород V и I в кровле гранитного массива,  кварцевая жила (15х9м) с богатыми содержаниями Au и минерализованная зона (1000х12м), сопровождаемая дайкой гранит-порфиров."],
["Золото","Благородные металлы","Металлы","Рудные","Проявление","","","0","","71.52","42.28","13212665","4689071","4","71.52","42.28","71.52","42.28","Кара-Бууринский район","/icon/Au04.png","780__Koybulak.txt","","","","Таласская область","","42.28","Геолсъемка м-ба 1:50000 <br>условия неблагопр, выс. 3600м,  трудная доступность,  район не освоен,  перспективы не ясны. <br><br>На  глуб 50м: Р2- 3.5т  <br><br>Au -1.2г/т  <br>Cu - 1.0%  <br><br>В сланцах R2 - минерализованная зона окварцевания длиной 200м и мощностью 70м."],
["Золото","Благородные металлы","Металлы","Рудные","Проявление","","","0","","71.7","42.25","13227646","4684765","4","71.7","42.25","71.7","42.25","Бакай-Атинский район","/icon/Au04.png","781__Postunbulak I.txt","","","","Таласская область","","42.25","Геолсъемка м-ба 1:50000.  <br>Условия благоприятные, выс. 2400-2700м, доступно. <br><br>На  глуб.100м:  <br>Р1 по рудному телу - - 0.6т (8г/т) <br>Р2 по минер. зоне - 11.0т (0.1г/т)  <br><br>Au-по рудн. телу -8г/т, по зоне - 0.1 г/т <br>Cu - 1.0%  <br>Ag - 30г/т <br>As - 0.3%  <br><br>Зона меланжа в кристаллических сланцах и филлитах R2, минерализованная зона (4кмх150м), рудное тело (150мх2.0)."],

];
	return data;	
}
br
